#language: ru
  Функционал: Домашняя работа Ренессанс кредит
    Сценарий: Сценарий 1 для домашней работы
      * кликаем в главном меню по пункту "Вклады"
      * выбираем валюту вклада "Рубли"
      * сумму вклада устанавливаем "300000"
      * срок вклада устанавливаем "6"
      * сумму ежемесячного платежа устанавливаем "50000"
      * нажимаем на переключатель "Ежемесячная капитализация"
      * сравниваем значение ставки со значением "5.90%"
      * сравниваем значение поля 'К снятию' со значением "562 566,02"
      * сравниваем значение поля 'Пополнение' со значением "250 000"
      * сравниваем значение поля 'Начисленно' со значением "12 566,02"

    Сценарий: Сценарий 2 для домашней работы
      * кликаем в главном меню по пункту "Вклады"
      * выбираем валюту вклада "Рубли"
      * сумму вклада устанавливаем "500000"
      * срок вклада устанавливаем "6"
      * сумму ежемесячного платежа устанавливаем "70000"
      * нажимаем на переключатель "Ежемесячная капитализация"
      * нажимаем на переключатель "Частичное снятие"
      * сравниваем значение ставки со значением "5.65%"
      * сравниваем значение поля 'К снятию' со значением "869 107,22"
      * сравниваем значение поля 'Пополнение' со значением "350 000"
      * сравниваем значение поля 'Начисленно' со значением "19 107,22"
